## **Trabalho final: Análise Exploratória de Dados**

Grupo: Bianca Muniz, Meyrele Torres e Ricardo Grimbaun

## **Análise exploratória univariada**
Variável escolhida: `idade`

In [1]:
# Importando as bibliotecas
import pandas as pd #para abrir e manipular as bases
import statistics #para o cálculo da moda
!pip install altair #instalando a biblioteca altair
import altair as alt #para as visualizações gráficas

Requirement already satisfied: altair in /usr/local/lib/python3.7/dist-packages (4.1.0)
Requirement already satisfied: pandas>=0.18 in /usr/local/lib/python3.7/dist-packages (from altair) (1.1.5)
Requirement already satisfied: jinja2 in /usr/local/lib/python3.7/dist-packages (from altair) (2.11.3)
Requirement already satisfied: jsonschema in /usr/local/lib/python3.7/dist-packages (from altair) (2.6.0)
Requirement already satisfied: toolz in /usr/local/lib/python3.7/dist-packages (from altair) (0.11.1)
Requirement already satisfied: entrypoints in /usr/local/lib/python3.7/dist-packages (from altair) (0.3)
Requirement already satisfied: numpy in /usr/local/lib/python3.7/dist-packages (from altair) (1.19.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas>=0.18->altair) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas>=0.18->altair) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas>=0.18->altair) (1.15.0)
Requirement already satisfied: MarkupSafe>=0.23 in /usr/local/lib/python3.7/dist-packages (from jinja2->altair) (2.0.1)

In [2]:
alt.data_transformers.disable_max_rows()

DataTransformerRegistry.enable('default')

In [3]:
# Carregando a base de dados
dados = pd.read_csv(r'https://raw.githubusercontent.com/biamuniz/trabalhofinal_eda_mjda/main/dados/microdados.csv', sep=';')

# Visualizando a base de dados
dados

         ano  ...   medalha
0       1896  ...    Bronze
1       1896  ...    Bronze
2       1896  ...    Bronze
3       1896  ...    Bronze
4       1896  ...    Bronze
...      ...  ...       ...
269713  2016  ...  No_medal
269714  2016  ...  No_medal
269715  2016  ...  No_medal
269716  2016  ...  No_medal
269717  2016  ...  No_medal

[269718 rows x 15 columns]

In [4]:
# estatísticas descritivas da base
print(dados.describe())

                 ano      id_atleta  ...         altura           peso
count  269718.000000  269718.000000  ...  210917.000000  208204.000000
mean     1978.626862   68263.967381  ...     175.338953      70.699237
std        29.747764   39026.038321  ...      10.518507      14.348346
min      1896.000000       1.000000  ...     127.000000      25.000000
25%      1960.000000   34654.250000  ...     168.000000      60.000000
50%      1988.000000   68233.000000  ...     175.000000      70.000000
75%      2002.000000  102111.000000  ...     183.000000      79.000000
max      2016.000000  135571.000000  ...     226.000000     214.000000

[8 rows x 5 columns]

Note que a base a base tem dados tem aproximadamente 270 mil observações, mas este valor não é compatível com o número de registros de `altura`, de `peso` e de `idade`. Logo, isso mostra a presença de missing data.

Olhando a base, podemos ver que há nomes que se repetem na coluna nome_atleta, pois um mesmo atleta pode participar de diferentes modalidades de um mesmo esporte.

Para prosseguirmos com a análise, limpamos a base com a finalidade de ter um registro por atleta em cada edição dos jogos, excluindo dessa maneira as colunas medalha e evento. Em seguida, removemos os valores duplicados. A base ficou com 189765 registros únicos.

In [5]:
dados_analise = dados.drop('evento', 1) # criando o dataframe 'analise_idade', que é uma cópia do 'df', sem a coluna 'evento'
dados_analise = dados_analise.drop('medalha', 1) # excluindo a coluna 'medalha' e sobrescrevendo o dataframe 'analise_idade'
dados_analise = dados_analise.drop_duplicates() # removendo valores duplicados

In [6]:
dados_analise

         ano  edicao     cidade_sede  ... altura  peso       esporte
0       1896  Summer          Athina  ...    NaN   NaN        Tennis
1       1896  Summer          Athina  ...    NaN   NaN       Cycling
3       1896  Summer          Athina  ...    NaN   NaN      Shooting
4       1896  Summer          Athina  ...    NaN   NaN       Fencing
5       1896  Summer          Athina  ...    NaN   NaN      Shooting
...      ...     ...             ...  ...    ...   ...           ...
269712  2016  Summer  Rio de Janeiro  ...  167.0  70.0       Sailing
269713  2016  Summer  Rio de Janeiro  ...  156.0  50.0       Sailing
269714  2016  Summer  Rio de Janeiro  ...  166.0  50.0  Table Tennis
269716  2016  Summer  Rio de Janeiro  ...  168.0  54.0  Table Tennis
269717  2016  Summer  Rio de Janeiro  ...  184.0  72.0     Athletics

[189765 rows x 13 columns]

In [7]:
dados_analise.select_dtypes(include=['number']) #incluindo um NaN nos dados ausentes

         ano  id_atleta  idade  altura  peso
0       1896      35698   22.0     NaN   NaN
1       1896     107006   23.0     NaN   NaN
3       1896      54456   21.0     NaN   NaN
4       1896      85988   29.0     NaN   NaN
5       1896      85988   29.0     NaN   NaN
...      ...        ...    ...     ...   ...
269712  2016     132986   24.0   167.0  70.0
269713  2016     133071   21.0   156.0  50.0
269714  2016     133346   26.0   166.0  50.0
269716  2016     134826   22.0   168.0  54.0
269717  2016     120422   24.0   184.0  72.0

[189765 rows x 5 columns]

In [8]:
# Análise descritiva da variável idade
dados_analise['idade'].describe()

count    182834.000000
mean         25.797220
std           6.104385
min          10.000000
25%          22.000000
50%          25.000000
75%          29.000000
max          97.000000
Name: idade, dtype: float64

In [9]:
#calculando a moda
statistics.mode(dados_analise['idade'])

23.0

In [ ]:
# Gráfico: Frequência de idade
chart1 = alt.Chart(dados_analise).mark_bar(color='firebrick').encode(
  x='idade',
  y='count(idade)',
)
chart1

**Variável escolhida: `esporte = atletismo`**

In [12]:
#Limpeza da base: queremos registros únicos de cada participante por edição e esporte
dados_esporte = dados.drop('evento', 1) # criando o dataframe 'dados_esporte', que é uma cópia de 'dados', sem a coluna 'evento'
dados_esporte = dados_esporte.drop('medalha', 1) # excluindo a coluna 'medalha' e sobrescrevendo o dataframe 'dados_esporte'
dados_esporte = dados_esporte.drop_duplicates() # removendo valores duplicados

In [13]:
atletismo = dados_esporte.loc[dados_esporte['esporte'] == 'Athletics']
atletismo

         ano  edicao     cidade_sede    pais  ... idade altura  peso    esporte
7       1896  Summer          Athina  France  ...  21.0    NaN   NaN  Athletics
10      1896  Summer          Athina  Greece  ...   NaN    NaN   NaN  Athletics
14      1896  Summer          Athina  Greece  ...  21.0    NaN   NaN  Athletics
20      1896  Summer          Athina  Greece  ...   NaN    NaN   NaN  Athletics
22      1896  Summer          Athina  Greece  ...   NaN    NaN   NaN  Athletics
...      ...     ...             ...     ...  ...   ...    ...   ...        ...
269681  2016  Summer  Rio de Janeiro     NaN  ...  23.0  163.0  50.0  Athletics
269682  2016  Summer  Rio de Janeiro     NaN  ...  21.0  157.0  50.0  Athletics
269697  2016  Summer  Rio de Janeiro     NaN  ...  31.0  168.0  50.0  Athletics
269711  2016  Summer  Rio de Janeiro     NaN  ...  21.0  178.0  66.0  Athletics
269717  2016  Summer  Rio de Janeiro     NaN  ...  24.0  184.0  72.0  Athletics

[30553 rows x 13 columns]

In [14]:
# Estatísticas sobre os participantes que competem no atletismo
atletismo.describe()

                ano      id_atleta         idade        altura          peso
count  30553.000000   30553.000000  29757.000000  26657.000000  26456.000000
mean    1979.018820   66933.612280     25.410492    176.490528     69.723768
std       30.575538   39284.347783      4.501478      9.515400     16.225084
min     1896.000000       8.000000     12.000000    142.000000     35.000000
25%     1960.000000   32313.000000     22.000000    170.000000     59.000000
50%     1988.000000   67307.000000     25.000000    176.000000     67.000000
75%     2004.000000  100630.000000     28.000000    183.000000     76.000000
max     2016.000000  135563.000000     52.000000    208.000000    165.000000

In [ ]:
# contagem de atletas por esporte
chart2 = alt.Chart(dados_esporte).mark_bar(color='green').encode(
  x='esporte',
  y='count(id_atleta)',
)
chart2

## **Análise exploratória bivariada**

**Variáveis escolhidas: `idade` e `sexo`**

In [15]:
# Estatísticas de idade para o sexo feminino
feminino = dados_analise["idade"].loc[dados_analise['sexo'] == 'F']
feminino.describe()

count    48893.000000
mean        24.431902
std          5.611215
min         11.000000
25%         21.000000
50%         24.000000
75%         28.000000
max         74.000000
Name: idade, dtype: float64

In [16]:
# Qual a idade mais frequente entre competidores do sexo feminino nos jogos olímpicos?
statistics.mode(dados_analise['idade'].loc[dados_analise['sexo'] == 'F'])

23.0

In [17]:
# Estatísticas para o sexo masculino
masculino = dados_analise["idade"].loc[dados_analise['sexo'] == 'M']
masculino.describe()

count    133941.000000
mean         26.295608
std           6.200323
min          10.000000
25%          22.000000
50%          25.000000
75%          29.000000
max          97.000000
Name: idade, dtype: float64

In [18]:
# Qual a idade mais frequente entre competidores do sexo masculino nos jogos olímpicos?
statistics.mode(dados_analise['idade'].loc[dados_analise['sexo'] == 'M'])

23.0

In [19]:
# criando a tabela "estatistica_idade_sexo", a partir de uma tabela dinâmica, comparando os resultados para os dois sexos
unused_columns = dados_analise.columns.difference(set(['sexo']).union(set([])).union(set({'idade'})))
tmp_df = dados_analise.drop(unused_columns, axis=1)
tab_dinamica_b = tmp_df.pivot_table(
    index=['sexo'],
    values=['idade'],
  aggfunc={'idade': ['mean', 'median', 'min', 'max', 'count']}) #media, mediana, valor mínimo e máximo para cada sexo
estatistica_idade_sexo = tab_dinamica_b.reset_index()
estatistica_idade_sexo # visualizando o resultado

  sexo   idade
         count   max       mean median   min
0    F   48893  74.0  24.431902   24.0  11.0
1    M  133941  97.0  26.295608   25.0  10.0

In [ ]:
chart3 = alt.Chart(dados_analise).mark_bar().encode(
    x=alt.X('sexo', axis=alt.Axis(title='sexo')),
    y=alt.Y('mean(idade)',
        axis=alt.Axis(title='idade')
    ),
    color=alt.Color('sexo:N')
)
chart3

In [21]:
unused_columns = dados_analise.columns.difference(set(['ano']).union(set(['sexo'])).union(set({'id_atleta'})))
tabela = dados_analise.drop(unused_columns, axis=1)
pivot_table = tabela.pivot_table(
    index=['ano'],
    columns=['sexo'],
    values=['id_atleta'],
    aggfunc={'id_atleta': ['count']}
)
participacao = pivot_table.reset_index()
participacao

       ano id_atleta
               count
sexo               F       M
0     1896       NaN   212.0
1     1900      26.0  1372.0
2     1904      10.0   837.0
3     1906      10.0   912.0
4     1908      45.0  2067.0
5     1912      63.0  2477.0
6     1920      93.0  2675.0
7     1924     193.0  3521.0
8     1928     344.0  3416.0
9     1932     223.0  2000.0
10    1936     443.0  4772.0
11    1948     524.0  4622.0
12    1952     630.0  5045.0
13    1956     516.0  3684.0
14    1960     757.0  5283.0
15    1964     880.0  5409.0
16    1968     994.0  5764.0
17    1972    1266.0  6902.0
18    1976    1491.0  5757.0
19    1980    1358.0  4999.0
20    1984    1846.0  6254.0
21    1988    2518.0  7439.0
22    1992    3236.0  8052.0
23    1994     522.0  1234.0
24    1996    3555.0  6854.0
25    1998     790.0  1413.0
26    2000    4102.0  6608.0
27    2002     887.0  1543.0
28    2004    4356.0  6296.0
29    2006     957.0  1554.0
30    2008    4662.0  6327.0
31    2010    1034.0  1518.0
32    2012    4687.0  5888.0
33    2014    1123.0  1698.0
34    2016    5060.0  6160.0

In [ ]:
# Gráfico: Participação nas Olimpíadas de acordo com o sexo
chart4 = alt.Chart(dados_analise).mark_bar().encode(
    x='ano',
    y='count(id_atleta)',
    color=alt.Color('sexo:N', scale=alt.Scale(range=["orange","green"]))
)
chart4 ### espaços em branco no gráfico = dados ausentes

In [ ]:
# normalizando os dados
chart4.mark_bar().encode(
    x='ano',
    y=alt.Y('count(id_atleta)', stack='normalize'),
    opacity=alt.value(0.7)
)

**Variáveis escolhidas: `idade`, `peso`, `altura` e `medalha = ouro`**

In [22]:
medalha_ouro = dados.loc[dados['medalha']=='Gold']

In [23]:
medalha_ouro = medalha_ouro.drop('evento', 1)
medalha_ouro = medalha_ouro.drop_duplicates() # removendo valores duplicados

In [24]:
medalha_ouro

        ano  edicao     cidade_sede  ...   peso        esporte medalha
13295  1896  Summer          Athina  ...    NaN      Athletics    Gold
13297  1896  Summer          Athina  ...    NaN       Swimming    Gold
13298  1896  Summer          Athina  ...    NaN        Cycling    Gold
13299  1896  Summer          Athina  ...    NaN  Weightlifting    Gold
13300  1896  Summer          Athina  ...    NaN        Cycling    Gold
...     ...     ...             ...  ...    ...            ...     ...
26659  2016  Summer  Rio de Janeiro  ...   64.0         Boxing    Gold
26660  2016  Summer  Rio de Janeiro  ...  109.0  Weightlifting    Gold
26661  2016  Summer  Rio de Janeiro  ...   52.0         Boxing    Gold
26662  2016  Summer  Rio de Janeiro  ...   75.0       Shooting    Gold
26663  2016  Summer  Rio de Janeiro  ...   74.0       Swimming    Gold

[12228 rows x 14 columns]

In [25]:
medalha_ouro.describe() # estatísticas descritivas sobre os medalhistas de ouro

                ano      id_atleta         idade       altura         peso
count  12228.000000   12228.000000  12094.000000  9625.000000  9388.000000
mean    1973.617926   69433.871933     25.999835   178.067221    74.626225
std       33.964288   39049.802106      5.846941    11.061828    15.327188
min     1896.000000       4.000000     13.000000   136.000000    28.000000
25%     1952.000000   36220.750000     22.000000   170.000000    64.000000
50%     1984.000000   69281.500000     25.000000   178.000000    74.000000
75%     2002.000000  103803.250000     29.000000   185.000000    84.000000
max     2016.000000  135553.000000     64.000000   223.000000   170.000000

In [26]:
statistics.mode(medalha_ouro['idade'])

24.0

In [27]:
statistics.mode(medalha_ouro['peso'])

70.0

In [28]:
statistics.mode(medalha_ouro['altura'])

180.0